{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"aobut me","text":"关于周勇发","link":"/aobut-me/index.html"}],"posts":[{"title":"WordPress 和继承者们","text":"本文原载于 Medium，作者是 Jason Gowans，这里是译文。 不管从哪个角度看，WordPress 都是一个现象级的产品。全世界有四分之一的网站都跑在 WordPress 上，它占据了全部CMS市场59%的份额。WordPress 上超过四万的插件、一万以上的主题，这些共同打造了一个无与伦比的生态系统，这里有超过十万的开发者和上千家主机提供商，其中专注于 WordPress 主机服务的 WPEngine 融资4100万美金，在他们的服务器上跑了20多万个网站，服务了超过23,000的用户。 WordPress.com 有不计其数的盈利手段，比如说主机、谷歌广告、主题购买、高级会员服务、技术支持、定向流量、保险库、视频发布等等。然而，这么一个巨无霸，他们的消费者加起来比冰岛人口还多，说它以后再也不能继续统治这个市场，有人会信吗？##那些个竞争对手下面这张表单上，你可以看到像 Squarespace 这样的公司，虽然只有可怜的0.4%市场份额，市值却达到了5亿美金。Automattic 和 Wix 也在这份表单上叨陪末座，所以我相信情况一定会有所变化。比如 Github Pages，好像才0.1%的份额？但这目前来说不过是程序员的玩具罢了。就算，WordPress有7千万的站点，Github Pages 只有70万，但后者的增长速度实在快的吓人，而且对专业人士尤其是开发者来说，把内容发布到 Github 上的流程比 WordPress 优雅许多。静态页面正在呈井喷式增长，如果 WordPress 这个十分成功且庞大的用 PHP 写成的生态系统再不有所调整的话，那会摔得很惨。 ##静态页面生成器WordPress 可以被细分成五个部分： 内容管理系统 模板引擎 插件 主题 主机一个静态页面生成器（Static SIte Generators）基本上就是一个输出静态元素（比如说HTML、CSS和JavaScript）的模板，然后这些静态元素会被存放在 CDN 上。就在写这篇文章的时候，市面上已经有用 Ruby,Go,Python各种语言写的超过100个的静态页面生成器。程序员越来越多的开始采用速度更快更安全确比 WordPress 更简单的SSG了，而且一般来说能更好的兼容 Github 和 Bitbucket 这些版本控制平台。David Walsh 在他的博客里很好的分析了静态站点的优势与劣势。我提程序员，是因为目前这个阶段，静态页面生成器很大程度上还只是一个开发工具。想把这个工具推广给世界上最牛逼的内容生产者，还要重走一遍 WordPress 曾经走过的路，比如需要一个轻量的编辑器，一个可以供独立开发者制作主题和软件的平台，还有就是智能托管，这也是 Aerobatic，Github Pages 等等团队正在做的。在我看来，一个智能主机团队可以做的事情可比存放站点要多得多了，这方面你可以去看 Aerobatic 的文档。静态页面生成器在搭建和编辑方面落后的距离在短时间内就可以轻松补上，并且可以接过 WP Engine 和 WordPress 的火炬。WP Engine 和 WordPress 自己会迎接这种革命吗？WP Engine 存在的意义就是弥补了 WordPress 的缺点，像龟速、堪忧的安全问题和对技术一知半解、对问题视而不见的用户社区。这样依附于 WordPress 的 WP Engine，有足够的动力去革自己的命吗？##WordPress 不是傻子看到这你或许相信了未来是属于静态页面的，也许也意识到了对WordPress 来讲说服那些自认为是 WordPress 开发者的人接受非 PHP 语言有多么困难。但 WordPress 的人不是傻子，他们不会干愣着坐以待毙，Calypso 计划上线后，WordPress 用 NodeJS 和 ReactJS 完全重写了他们的内容管理系统，输出的也是静态页面！也就是说，WordPress 也动摇了，他们开始往 JavaScipt 和 Github 方向靠。不过最大的挑战是要说服数十万的 PHP 开发者来接受这一变化。 即使是 Calypso 计划的成员也得面对我们的威胁。虽然我们团队没有人是很牛的 JavaScript 程序员，但每天我们都可以积累经验，犯的错误我们会去反省，然后改正，吸取教训。当我们的计划有所进步时，我们就为其他工程师树立了标杆，并且会在业内分享我们的知识。 既然 WordPress 的内容管理系统已经重写为静态的了，那么他们的模板引擎呢？那么庞大的插件和主题平台呢？这些问题决定了未来网络内容出版的方向，这可是几十亿美金的生意啊。一个读者在他的评论中写了他的想法： 我认为 PHP 世界是该醒醒了。PHP7 是一个好的改变但还做得不够。醒醒吧，WordPress 都开始摆脱PHP 了。 毋庸置疑，五年后的 WordPress 肯定不会和现在的地位一样。那些做静态页面生成器的 Jekyll、Hugo和做智能托管的 Aerobatic 等公司一定会拔地而起。有一亿四千万美金在手的 WordPress 不一定会死，但就像 Squarespace 那样，即使只有0.4% 份额，也可以做到五亿美金估值。这是是个十分巨大的而且还在成长的市场，创业公司有数不尽的机会去大展拳脚，完全不用担心那几十万程序员的死活（PHP 再次躺枪-_-!）。 我最早贴出这篇文章的时候，我把 WordPress 里的大写「P」错打成了小写「p」，本来没想改的，但是一想到大写「P」对很多人来说很重要，还是给改了（又黑 PHP 一把？）。发布于 2016年03月02日","link":"/2017/12/09/WordPress-%E5%92%8C%E7%BB%A7%E6%89%BF%E8%80%85%E4%BB%AC/"},{"title":"如何做需求分析","text":"产品的构思初期，我们会罗列尽可能多需求，也会收集到很多需求。但有些需求是伪需求，有些需求也不具备实现价值，那我们如何做判断呢？每天有无数产品诞生，也有无数产品陨落，很多时候会谈到一个原因，没有把握住用户需求，吸引不了用户。那如何把握住用户需求呢？各种各样的需求，如何毫无克制地加载功能去满足用户，最终也会导致产品变得臃肿和失去核心定位。那怎么提炼呢？这也就是这篇文章的思考主题，我们如何做需求分析？ 1. 用户需求与产品需求 用户需求是用户从自身角度出发，自以为的需求。 用户经常提出的需求，从他们角度而言都是正确的，但更多是从自身情况考虑，对于产品的某个功能有自己的期望，但对产品定位、设计的依据等情况不了解，他们的建议也许并不是该功能的最好实现方式，也就不足以直接作为产品规划的直接依据。 产品需求是提炼分析用户真实需求，并符合产品定位的解决方案。 解决方案可以理解为一个产品，一个功能或服务，一个活动，一个机制。 需求分析：从用户提出的需求出发，挖掘用户内心真正的目标，并转为为产品需求的过程。 我们不能简单地看用户需求，而是应该去挖掘用户产生这个需求时，其心里是什么驱动着用户。所以，更应该思考，需求分析的过程，是如何把用户需求转为为产品需求，中间的纽带是什么？什么可以把产品需求转化为用户需求？ 2. 人性在想如何把用户需求转化为产品需求的中间纽带是什么，不禁要问一个问题，用户需求是怎么产生的？我们只用把原因研究清楚了，才有可能通过产品需求去迎合用户需求。我们追本溯源，用户的需求或者说是欲望究竟缘何而生？分析人性这个问题有两个理论思维可以给我们切入去思考。 2.1 马斯洛需求理论马斯洛需求理论出自经典著作《人的动机理论》的马斯洛需求理论，它阐述了人类的需求源于五类，即生理需求、安全需求、社交需求、尊重需求和自我实现需求。 人类最基本生理需求是衣食住行，若无法满足，人类无法生存。这也是我们提及最多的用户刚需，每一天都离不开，也就蕴含着巨大的市场空间，是众多创业公司和巨头一直抢占的各个山头。 随之产生的是安全需求，希望生活有所保障，避免被物理伤害。这是医疗人身保障等社会基础设施的建设，是“互联网+”正在升级的主要领域。 两个需求得到满足后个体会产生友谊、爱情、亲情等各种感情诉求，也渴望成为集体的一部分，几乎没有人希望过着孤独，不与外界产生联系的生活。这块目前最主要便是企鹅帝国的两大关系链产品。随后希望被人尊重，得到认可和赞赏，名誉、声望和地位的尊重需求，这种需求很少得到充分满足。 自我实现是最高层次的一种需求，实现个人抱负、理想、价值的需要。 2.2七宗罪 七宗罪在圣经中，人类有七宗罪： 淫欲、贪食、贪婪、懒惰、暴怒、妒忌、 傲慢。 淫欲，情色网站是被中国政府和法律所禁止的，可依旧屡禁不止的，可想是多么痛的痛点需求呀。典型代表有陌陌、快播、微信的摇一摇、附近的人、YY美女主播等。贪食，每个人都有一个胃，每天三餐，美味和食物总对人有着强大的诱惑力，美味分享生活分享类的网站，正是满足了饕餮的特性。贪婪，总是渴求得更多，永远不会满足，于是淘宝的双十一，京东一轮又一轮的促销，各种团队促销优惠卷红包不停。懒惰，这是互联网原则，互联网的存在就是让我们能更“懒”地完成事情，世界为“懒”人所创造，科技为“懒”人所进步。暴怒，网络游戏的杀戮与游戏装备热卖，玩的就是人性暴怒的本质。妒忌，网络是个分享的社会，一个贫富共通的平台，于是在网络上总凝聚了不同的声音，总有人在上面咒骂这个社会，总有人在抱怨着不满意，而这些均由妒忌所生。傲慢，亦是虚荣，分享有时是快乐的，而满足虚荣有时也能产生快感，某些事物从不产生实际价值，只是一份虚荣心，比如QQ秀、各种钻、微博、朋友圈晒、点赞等。 一款好的产品，一定是迎合人性的。 张小龙也表示把握人性是一款产品很重要的一个环节，知道用户内心最需要什么，才能真正做出让用户喜欢的产品，当然有些东西会突破道德底线，甚至可能会触犯法律，总之既要满足人内心的欲望，又要让产品生存下去，所以打擦边球很重要，这也是一个度的控制。 3.用户动机用户的底层欲望就是源于这些人性，而人性产生的欲望，在不同的环境中，因不同的形式、不同的行为之下，会产生各种各样动机，想要达到某种目标，而产品需求，正是迎合用户的动机，来帮助用户更好地实现目标。被引用最多的一个例子，便是福特汽车创始人 - 亨利福特说的： “如果听用户的，我们根本造不出汽车来，用户就是需要一匹快马。” 其实，用户究竟需要一匹马还是一辆车，就是需要分析用户情境之下的动机是什么？如果是赛马想获得成绩，那确实需要一匹更快的马；如果是想更快地去另一个地方，汽车就是更好地满足用户的需求。在挖掘用户动机之时，就可以尝试判断是伪需求还是真需求。 4.如何挖掘用户动机？如果只是看需求和产品本身，是很难看出产品设计背后逻辑，如果放到场景里去，放到人和产品的交互里去，可以更好地看出产品设计的奥妙在哪里。 用户的动机会被很当时环境下的复杂因素所影响，这是非常考验用户研究和产品经理的硬本事。但我们也可以尝试从几个关键因素来进行场景分析。 基于什么环境：地铁/办公室/室内/公共场合/走路/夜晚/户外……深入情景周围的细节中去。 基于什么用户：具备什么特征，比如身份、收入、区域….. 基于什么行为：行为或操作流程，比如购物流程、操作习惯、行为认知……. 场景分析也就是需要考虑具体什么环境（时间、地点、情境）什么类型用户的什么动机，想达到什么目标，以及人与人的关系。如实地记录下来，如果偏差或缺乏信息，之后的分析就会有所偏差。 可能还有辅以用户访谈、问卷调查等各种用户调研方法，进行信息的收集和补充。基于这些分析出场景中对用户动机和完成目标真正起作用的因素，而后转换为产品语言描述产品需求。 5.如何筛选需求？前面说到用户需求只是用户自以为的需求，不够专业，而且有时用户说的并非心中所想，也可能不会表达内心真实需求。 所以，在筛选需求的时候，除了需要挖掘用户动机寻找真实需求的同时，还需要考虑一下几点：该用户是否为目标用户：如果不是产品针对的目标用户，其建议或需求的参考价值可能没那么大。该需求是否符合产品定位：该需求的满足可能会影响产品的核心服务，破坏用户体验。该需求是否能实现：评估这个需求需要多少开发资源或运营能力，价值有多大？在考虑需求价值时候，可以从四个维度考虑：广度：该需求的受众面有多大？频率：该需求的使用频露是以日/周/月为周期？强度：该需求对用户有多强烈需要？时机：该需求是否符合产品的规划，当下的环境？ “满足需求的产品”与“让用户尖叫的产品”之间，区别就在于对人性的把握。 作者：小徐同学链接：https://www.zhihu.com/question/20407032/answer/55674574来源：知乎 #商业短租空间#","link":"/2017/12/20/%E5%A6%82%E4%BD%95%E5%81%9A%E9%9C%80%E6%B1%82%E5%88%86%E6%9E%90/"},{"title":"红柑科技业务正式整合到送福互联网服务平台","text":"新征程2017年12月起，红柑科技业务正式整合到送福互联网服务平台。 红柑科技经过一年多的发展，在微信代运营、微信现场活动互动、微信公众号开发等几块业务发展取得一定的进展和成绩，合作的客户包括政府单位、全国大型卫浴企业总部、学校、国企等。为了壮大业务范围，红柑迎来新的合作伙伴—送福马总。我们将整合红柑科技的技术力量，结合送福原来开展的餐饮业运营、销售团队，并开展新的开发运营方向。 敬请期待—共享空间","link":"/2017/12/08/%E7%BA%A2%E6%9F%91%E7%A7%91%E6%8A%80%E4%B8%9A%E5%8A%A1%E6%AD%A3%E5%BC%8F%E6%95%B4%E5%90%88%E5%88%B0%E9%80%81%E7%A6%8F%E4%BA%92%E8%81%94%E7%BD%91%E6%9C%8D%E5%8A%A1%E5%B9%B3%E5%8F%B0/"}],"tags":[{"name":"产品","slug":"产品","link":"/tags/%E4%BA%A7%E5%93%81/"}],"categories":[]}